

const newsState ={
  postNews:[ 
     { 
     newsHeading: "Окружающий мир", 
   newsText: "Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки соответствующий условий активизации. Не следует, однако забывать, что консультация с широким активом способствует подготовки и реализации систем массового участия." 
      },
      {
         newsHeading: "Окружающий мир",
         newsText: "Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки соответствующий условий активизации. Не следует, однако забывать, что консультация с широким активом способствует подготовки и реализации систем массового участия."
      },
      {
         newsHeading: "Окружающий мир",
         newsText: "Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки соответствующий условий активизации. Не следует, однако забывать, что консультация с широким активом способствует подготовки и реализации систем массового участия."
      }

]
}
export const newsReducer = (state = newsState, action) => {
  
     
           
    return state;

}







